{
  "BookRecs":
  [
    {"bookGenre":"Action","bookTitle":"Stormbreaker","bookAuthor":"Anthony Horowitz","bookDescription":"'They said his uncle Ian died in a car accident. But Alex Rider knows that's a lie, and the bullet holes in the windshield prove it. Yet he never suspected the truth: his uncle was really a spy for Britain's top secret intelligence agency. And now Alex has been recruited to find his uncle's killers . . .'","bookPrice":"9.00","bookCover":"https://raw.githubusercontent.com/klouderm/IT315Project/main/stormbreaker.jpeg","bookSite":"https://www.amazon.com/Stormbreaker-Alex-Rider-Anthony-Horowitz/dp/0142406112/ref=sr_1_1?crid=1VZX8H544B78G&dchild=1&keywords=stormbreaker+anthony+horowitz&qid=1615855592&sprefix=stormbreaker+anthony%2Caps%2C145&sr=8-1"},
    {"bookGenre":"Fantasy","bookTitle":"The Fellowship of the Ring","bookAuthor":"J. R. R. Tolkien","bookDescription":"'One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkeness bind them. In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, The Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell into the hands of Bilbo Baggins, as told in The Hobbit.'","bookPrice":"8.50","bookCover":"https://raw.githubusercontent.com/klouderm/IT315Project/main/lotr.jpeg","bookSite":"https://www.amazon.com/dp/0547928211/ref=redir_mobile_desktop?_encoding=UTF8&aaxitk=41epXW6ED6GVE.50JCUqFg&hsa_cr_id=3967732140501&pd_rd_plhdr=t&pd_rd_r=3f7dc37c-c4a5-48bd-8d22-ae769b56a2a8&pd_rd_w=1OY9s&pd_rd_wg=sd66n&ref_=sbx_be_s_sparkle_td_asin_0_title"},
    {"bookGenre":"Mystery","bookTitle":"Later","bookAuthor":"Stephen King","bookDescription":"'The son of a struggling single mother, Jamie Conklin just wants an ordinary childhood. But Jamie is no ordinary child. Born with an unnatural ability his mom urges him to keep secret, Jamie can see what no one else can see and learn what no one else can learn. But the cost of using this ability is higher than Jamie can imagine—as he discovers when an NYPD detective draws him into the pursuit of a killer who has threatened to strike from beyond the grave.'","bookPrice":"10.00","bookCover":"https://raw.githubusercontent.com/klouderm/IT315Project/main/later.jpeg","bookSite":"https://www.amazon.com/Later-Stephen-King/dp/1789096499/ref=sr_1_1?crid=FYKVKOEZXJCW&keywords=later+stephen+king&qid=1615855938&s=books&sprefix=Later%2Cstripbooks%2C163&sr=1-1"},
    {"bookGenre":"Nonfiction","bookTitle":"A Promised Land","bookAuthor":"Barack Obama","bookDescription":"'In the stirring, highly anticipated first volume of his presidential memoirs, Barack Obama tells the story of his improbable odyssey from young man searching for his identity to leader of the free world, describing in strikingly personal detail both his political education and the landmark moments of the first term of his historic presidency—a time of dramatic transformation and turmoil.'","bookPrice":"24.00","bookCover":"https://raw.githubusercontent.com/klouderm/IT315Project/main/apl.jpeg","bookSite":"https://www.amazon.com/A-Promised-Land-Obama-Audiobook/dp/B08HGH9JMF/ref=sr_1_1?dchild=1&keywords=a+promised+land&qid=1615855987&s=books&sr=1-1"},
    {"bookGenre":"Romance","bookTitle":"To All the Boys I've Loved Before","bookAuthor":"Jenny Han","bookDescription":"'Sixteen-year-old Lara Jean Song keeps her love letters in a hatbox her mother gave her. They aren’t love letters that anyone else wrote for her; these are ones she’s written. One for every boy she’s ever loved—five in all. When she writes, she pours out her heart and soul and says all the things she would never say in real life, because her letters are for her eyes only. Until the day her secret letters are mailed, and suddenly, Lara Jean’s love life goes from imaginary to out of control.'","bookPrice":"15.00","bookCover":"https://raw.githubusercontent.com/klouderm/IT315Project/main/tatbilb.jpeg","bookSite":"https://www.amazon.com/All-Boys-Ive-Loved-Before/dp/B07XGDH6H5/ref=sr_1_1?crid=2SHN9FRRDXD9Y&dchild=1&keywords=to+all+the+boys+i%27ve+loved+before&qid=1615856024&s=audible&sprefix=to+all+the+%2Caudible%2C149&sr=1-1"},
    {"bookGenre":"Young Adult","bookTitle":"On the Come Up","bookAuthor":"Angie Thomas","bookDescription":"'Sixteen-year-old Bri wants to be one of the greatest rappers of all time. Or at least win her first battle. It’s hard to get your come up when you’re labeled a hoodlum at school, and your fridge at home is empty after your mom loses her job. So Bri pours her anger and frustration into her first song, which goes viral ...for all the wrong reasons. Bri soon finds herself at the center of a controversy, portrayed by the media as more menace than MC. But with an eviction notice staring her family down, Bri doesn’t just want to make it—she has to. Even if it means becoming the very thing the public has made her out to be.'","bookPrice":"9.50","bookCover":"https://raw.githubusercontent.com/klouderm/IT315Project/main/otcu.jpeg","bookSite":"https://www.amazon.com/On-Come-Up-Angie-Thomas-audiobook/dp/B079YCK5JT/ref=sr_1_1?dchild=1&keywords=on+the+come+up&qid=1615856073&s=audible&sr=1-1"}
  ],
  "Status":"OK"
}
